fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>ВКМ_ПериодС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ПериодПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВКМ_Заказы</name>
    <attributes>
      <name>ВКМ_Выбран</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_Заказ</name>
      <type>
        <types>DocumentRef.ЗаказПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_Статус</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>120</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеСотрудникомРаботы</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ВКМ_ЗаполнитьСписокЗаказов(ПериодС, ПериодПо) Экспорт

	ТаблицаЗаказов = Новый ТаблицаЗначений;
	ТаблицаЗаказов.Колонки.Добавить("ВКМ_Выбран", Новый ОписаниеТипов("Булево"));
	ТаблицаЗаказов.Колонки.Добавить("ВКМ_Заказ", Новый ОписаниеТипов("ДокументСсылка.ЗаказПокупателя"));
	ТаблицаЗаказов.Колонки.Добавить("ВКМ_Дата", Новый ОписаниеТипов("Дата"));
	ТаблицаЗаказов.Колонки.Добавить("ВКМ_Контрагент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТаблицаЗаказов.Колонки.Добавить("ВКМ_Сумма", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	ТаблицаЗаказов.Колонки.Добавить("ВКМ_Статус", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(120)));

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Заказы.Ссылка КАК Заказ,
	|	Заказы.Дата КАК Дата,
	|	Заказы.Контрагент КАК Контрагент,
	|	Заказы.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	Документ.ЗаказПокупателя КАК Заказы
	|ГДЕ
	|	Заказы.Проведен
	|	И Заказы.Дата МЕЖДУ &ПериодС И &ПериодПо
	|
	|УПОРЯДОЧИТЬ ПО
	|	Заказы.Дата";

	Запрос.УстановитьПараметр("ПериодС", НачалоДня(ПериодС));
	Запрос.УстановитьПараметр("ПериодПо", КонецДня(ПериодПо));

	МассивЗаказов = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаЗаказов.Добавить();
		НоваяСтрока.ВКМ_Выбран = Истина;
		НоваяСтрока.ВКМ_Заказ = Выборка.Заказ;
		НоваяСтрока.ВКМ_Дата = Выборка.Дата;
		НоваяСтрока.ВКМ_Контрагент = Выборка.Контрагент;
		НоваяСтрока.ВКМ_Сумма = Выборка.СуммаДокумента;
		МассивЗаказов.Добавить(Выборка.Заказ);
	КонецЦикла;

	ЗаказыСАктами = ВКМ_ПолучитьСоответствиеЗаказовСАктами(МассивЗаказов);
	Для Каждого СтрокаЗаказа Из ТаблицаЗаказов Цикл
		СтрокаЗаказа.ВКМ_Статус = ?(ЗаказыСАктами.СодержитКлюч(СтрокаЗаказа.ВКМ_Заказ),
			НСтр("ru = 'Акт уже создан'"),
			НСтр("ru = 'Готов к созданию акта'"));
	КонецЦикла;

	Возврат ТаблицаЗаказов;

КонецФункции

Функция ВКМ_ВыполнитьМассовоеСозданиеАктов(ТаблицаЗаказов, ИдентификаторОперации = Неопределено) Экспорт

	СсылкиЗаказов = ВКМ_ПодготовитьВыбранныеЗаказы(ТаблицаЗаказов);
	Если СсылкиЗаказов.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(ИдентификаторОперации);
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Массовое создание актов по заказам'");

	Возврат ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыВыполнения,
		"Документы.ЗаказПокупателя.ВКМ_СоздатьАктыПоЗаказамВФоне",
		СсылкиЗаказов);

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВКМ_ПодготовитьВыбранныеЗаказы(ТаблицаЗаказов)

	СсылкиЗаказов = Новый Массив;
	Если ТаблицаЗаказов = Неопределено Тогда
		Возврат СсылкиЗаказов;
	КонецЕсли;

	ВыбранныеСсылки = Новый Массив;
	Для Каждого СтрокаЗаказа Из ТаблицаЗаказов Цикл
		Если НЕ СтрокаЗаказа.ВКМ_Выбран Тогда
			Продолжить;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СтрокаЗаказа.ВКМ_Заказ) Тогда
			Продолжить;
		КонецЕсли;
		ВыбранныеСсылки.Добавить(СтрокаЗаказа.ВКМ_Заказ);
	КонецЦикла;

	ЗаказыСАктами = ВКМ_ПолучитьСоответствиеЗаказовСАктами(ВыбранныеСсылки);
	Для Каждого СсылкаЗаказа Из ВыбранныеСсылки Цикл
		Если НЕ ЗаказыСАктами.СодержитКлюч(СсылкаЗаказа) Тогда
			СсылкиЗаказов.Добавить(СсылкаЗаказа);
		КонецЕсли;
	КонецЦикла;

	Возврат СсылкиЗаказов;

КонецФункции

Функция ВКМ_ПолучитьСоответствиеЗаказовСАктами(МассивЗаказов)

	СоответствиеЗаказов = Новый Соответствие;
	Если МассивЗаказов = Неопределено Или МассивЗаказов.Количество() = 0 Тогда
		Возврат СоответствиеЗаказов;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Акты.Основание КАК ЗаказПокупателя
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК Акты
	|ГДЕ
	|	Акты.Основание ССЫЛКА Документ.ЗаказПокупателя
	|	И Акты.Основание В (&МассивЗаказов)";
	Запрос.УстановитьПараметр("МассивЗаказов", МассивЗаказов);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СоответствиеЗаказов.Вставить(Выборка.ЗаказПокупателя, Истина);
	КонецЦикла;

	Возврат СоответствиеЗаказов;

КонецФункции

#КонецОбласти

#КонецЕсли
